import re

# 北京公交集团线路号正则
bpt_line_regex = re.compile(r'运通[0-9]{1,3}|'
                            r'特[1-9][0-9]?快?|'
                            r'快?专[1-9][0-9]{0,2}|'
                            r'[1-9][0-9]{0,2}快?内快?|'
                            r'[1-9][0-9]{0,2}快?外快?|'
                            r'[1-9][0-9]{0,2}快|'
                            r'BRT[1-4]|'
                            r'[1-9][0-9]{0,2}|'
                            r'定制公交|'
                            r'F[1-9][0-9]?|'
                            r'C1[0-2][0-9]|'
                            r'Y[0-9]{1,2}|'
                            r'T[0-9]{1,3}|'
                            r'夜[0-9]{1,2}|'
                            r'快速直达专线[0-9]{1,3}')
# 非公交集团郊县线路号正则
non_bpt_line_regex = re.compile(r'昌[1-9][0-9]?|'
                                r'顺[1-9][0-9]?|'
                                r'兴[1-9][0-9]?|'
                                r'空港1[0-9]?|'
                                r'郊[1-9][0-9]{0,2}|'
                                r'密[1-9][0-9]?')
# 车辆自编号正则（运通线路自编号可为 4 位，老照片自编号可为 5-7 位）
number_regex = re.compile(r'[1-9][0-9]{3,6}|'
                          r'D[1-9][0-9]{5}|'
                          r'B[1-9][0-9]{5}|'
                          r'0[1245689][0-9]{4}|'
                          r'兴-[0-9]{2}-[0-9]{4}')
# 车牌号正则
id_regex = re.compile(r'[\u4e00-\u9fa5][A-Z]·[0-9A-Z]{5,6}D?F?')
